/*****************************************************************************
 * STbox
 *****************************************************************************/
SELECT stbox 'STBOX((1.0, 2.0), (1.0, 2.0))';
       stbox        
-------------------
 STBOX((1,2),(1,2))
(1 row)

SELECT stbox 'STBOX Z((1.0, 2.0, 3.0), (1.0, 2.0, 3.0))';
          stbox           
-------------------------
 STBOX Z((1,2,3),(1,2,3))
(1 row)

SELECT stbox 'STBOX M((1.0, 2.0, 3.0), (1.0, 2.0, 3.0))';
          stbox           
-------------------------
 STBOX M((1,2,3),(1,2,3))
(1 row)

SELECT stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))';
             stbox             
------------------------------
 STBOX ZM((1,2,3,4),(1,2,3,4))
(1 row)

SELECT stbox 'GEODBOX((1.0, 2.0, 3.0), (1.0, 2.0, 3.0))';
           stbox           
--------------------------
 GEODBOX((1,2,3),(1,2,3))
(1 row)

SELECT stbox 'GEODBOX M((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))';
              stbox              
--------------------------------
 GEODBOX M((1,2,3,4),(1,2,3,4))
(1 row)

/* Errors */
SELECT stbox 'AAA(1, 2, 3)';
ERROR:  Could not parse STBOX
LINE 2: SELECT stbox 'AAA(1, 2, 3)';
                    ^
SELECT stbox 'stbox(1, 2, 3)';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox(1, 2, 3)';
                    ^
SELECT stbox 'stbox((AA, 2, 3))';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox((AA, 2, 3))';
                    ^
SELECT stbox 'stbox((1, AA, 3))';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox((1, AA, 3))';
                    ^
SELECT stbox 'stbox z((1, 2, AA))';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox z((1, 2, AA))';
                    ^
SELECT stbox 'stbox m((1, 2, AA))';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox m((1, 2, AA))';
                    ^
SELECT stbox 'stbox((1, 2, 3))';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox((1, 2, 3))';
                    ^
SELECT stbox 'stbox m((1, 2, 3))';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox m((1, 2, 3))';
                    ^
SELECT stbox 'stbox m((1, 2, 3),()';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox m((1, 2, 3),()';
                    ^
SELECT stbox 'stbox m((1, 2, 3),(1)';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox m((1, 2, 3),(1)';
                    ^
SELECT stbox 'stbox z((1, 2, 3),(1,2)';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox z((1, 2, 3),(1,2)';
                    ^
SELECT stbox 'stbox m((1, 2, 3),(1,2)';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox m((1, 2, 3),(1,2)';
                    ^
SELECT stbox 'stbox m((1, 2, 3),(1,2,3)';
ERROR:  Could not parse STBOX
LINE 1: SELECT stbox 'stbox m((1, 2, 3),(1,2,3)';
                    ^
SELECT stbox(1,2,3,4);
       stbox        
-------------------
 STBOX((1,3),(2,4))
(1 row)

SELECT stbox(1,2,3,4,5,6);
          stbox           
-------------------------
 STBOX Z((1,3,5),(2,4,6))
(1 row)

SELECT stbox(1,2,3,4,5,6,7,8);
             stbox             
------------------------------
 STBOX ZM((1,3,5,7),(2,4,6,8))
(1 row)

SELECT stbox3dm(1,2,3,4,5,6);
         stbox3dm         
-------------------------
 STBOX M((1,3,5),(2,4,6))
(1 row)

SELECT geodbox(1,2,3,4,5,6);
         geodbox          
--------------------------
 GEODBOX((1,3,5),(2,4,6))
(1 row)

SELECT geodbox(1,2,3,4,5,6,7,8);
            geodbox             
--------------------------------
 GEODBOX M((1,3,5,7),(2,4,6,8))
(1 row)

SELECT stbox(8,7,6,5,4,3,2,1);
             stbox             
------------------------------
 STBOX ZM((7,5,3,1),(8,6,4,2))
(1 row)

SELECT stbox3dm(6,5,4,3,2,1);
         stbox3dm         
-------------------------
 STBOX M((5,3,1),(6,4,2))
(1 row)

SELECT geodbox(8,7,6,5,4,3,2,1);
            geodbox             
--------------------------------
 GEODBOX M((7,5,3,1),(8,6,4,2))
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((2.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
       -1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((2.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
        1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 3.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
       -1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 3.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
        1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 4.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
       -1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 4.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
        1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 5.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
       -1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 5.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
        1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (2.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
       -1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (2.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
        1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 3.0, 3.0, 4.0))');
 stbox_cmp 
----------
       -1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 3.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
        1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 4.0, 4.0))');
 stbox_cmp 
----------
       -1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 4.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
        1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 5.0))');
 stbox_cmp 
----------
       -1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 5.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
        1
(1 row)

SELECT stbox_cmp(stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))', stbox 'STBOX ZM((1.0, 2.0, 3.0, 4.0), (1.0, 2.0, 3.0, 4.0))');
 stbox_cmp 
----------
        0
(1 row)

SELECT count(*) FROM tbl_stbox t1, tbl_stbox t2 where t1.b = t2.b;
 count 
-------
   100
(1 row)

SELECT count(*) FROM tbl_stbox t1, tbl_stbox t2 where t1.b <> t2.b;
 count 
-------
  9900
(1 row)

SELECT count(*) FROM tbl_stbox t1, tbl_stbox t2 where t1.b < t2.b;
 count 
-------
  4950
(1 row)

SELECT count(*) FROM tbl_stbox t1, tbl_stbox t2 where t1.b <= t2.b;
 count 
-------
  5050
(1 row)

SELECT count(*) FROM tbl_stbox t1, tbl_stbox t2 where t1.b > t2.b;
 count 
-------
  4950
(1 row)

SELECT count(*) FROM tbl_stbox t1, tbl_stbox t2 where t1.b >= t2.b;
 count 
-------
  5050
(1 row)

SELECT count(*) FROM tbl_tgeompoint WHERE temp::stbox IS NOT NULL;
 count 
-------
   100
(1 row)

SELECT count(*) FROM tbl_tgeogpoint WHERE temp::stbox IS NOT NULL;
 count 
-------
   100
(1 row)

SELECT count(*) FROM tbl_stbox t1, tbl_stbox t2 where t1.b && t2.b;
 count 
-------
   100
(1 row)

SELECT count(*) FROM tbl_stbox t1, tbl_stbox t2 where t1.b @> t2.b;
 count 
-------
   100
(1 row)

SELECT count(*) FROM tbl_stbox t1, tbl_stbox t2 where t1.b <@ t2.b;
 count 
-------
   100
(1 row)

SELECT count(*) FROM tbl_stbox t1, tbl_stbox t2 where t1.b ~= t2.b;
 count 
-------
   100
(1 row)

/*****************************************************************************/
